<a href="https://colab.research.google.com/github/rajat4057/PandasExercises/blob/master/Merge_Exercise_3.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Housing Market

### Introduction:

This time we will create our own dataset with fictional numbers to describe a house market. As we are going to create random data don't try to reason of the numbers.

### Step 1. Import the necessary libraries

In [0]:
import numpy as np
import pandas as pd

### Step 2. Create 3 differents Series, each of length 100, as follows: 
1. The first a random number from 1 to 4 
2. The second a random number from 1 to 3
3. The third a random number from 10,000 to 30,000

In [0]:
series1=pd.Series(np.random.randint(1,high=5,size=100))
series2=pd.Series(np.random.randint(1,high=4,size=100))
series3=pd.Series(np.random.randint(10000,high=30001,size=100))

In [5]:
series3

0     14594
1     24327
2     10499
3     12158
4     28473
5     25849
6     23334
7     18787
8     28237
9     14316
10    15595
11    26163
12    13875
13    14563
14    23069
15    28440
16    11540
17    21283
18    18377
19    12625
20    12575
21    16235
22    27288
23    17266
24    20113
25    28786
26    28481
27    17586
28    11776
29    12841
      ...
70    18552
71    27260
72    23843
73    14286
74    27517
75    29133
76    13445
77    29371
78    23335
79    21642
80    29857
81    17853
82    22922
83    16110
84    29096
85    10578
86    18326
87    22251
88    14467
89    17762
90    20436
91    20553
92    23824
93    20089
94    19813
95    21939
96    11443
97    25338
98    25214
99    18675
Length: 100, dtype: int64

### Step 3. Let's create a DataFrame by joinning the Series by column

In [0]:
df=pd.DataFrame(pd.concat([series1,series2,series3],axis=1))

### Step 4. Change the name of the columns to bedrs, bathrs, price_sqr_meter

In [0]:
df.columns=['bedrs','bathrs','price_sqr_meter']

### Step 5. Create a one column DataFrame with the values of the 3 Series and assign it to 'bigcolumn'

In [18]:
#newdf=pd.DataFrame(pd.concat([series1,series2,series3],axis=0))
#newdf.columns=['bigcolumn']
newdf

    bigcolumn
0           4
1           1
2           2
3           2
4           2
5           2
6           4
7           4
8           1
9           2
10          4
11          1
12          2
13          3
14          3
15          3
16          2
17          2
18          3
19          3
20          4
21          3
22          1
23          1
24          2
25          1
26          1
27          2
28          4
29          2
..        ...
70      18552
71      27260
72      23843
73      14286
74      27517
75      29133
76      13445
77      29371
78      23335
79      21642
80      29857
81      17853
82      22922
83      16110
84      29096
85      10578
86      18326
87      22251
88      14467
89      17762
90      20436
91      20553
92      23824
93      20089
94      19813
95      21939
96      11443
97      25338
98      25214
99      18675

[300 rows x 1 columns]

### Step 6. Ops it seems it is going only until index 99. Is it true?

In [20]:
newdf.index

Int64Index([ 0,  1,  2,  3,  4,  5,  6,  7,  8,  9,
            ...
            90, 91, 92, 93, 94, 95, 96, 97, 98, 99],
           dtype='int64', length=300)

### Step 7. Reindex the DataFrame so it goes from 0 to 299

In [22]:
newdf.reset_index(drop=True,inplace=True)
newdf.index

RangeIndex(start=0, stop=300, step=1)